DataProcessors/ЗонаОтгрузкиТаксист1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗонаОтгрузкиТаксист1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолТара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТараПЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вернул</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/СписаниеТовараСЗоныОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СписаниеТовараСЗоныОтгрузки</Name>
			<BasedOn>
				<xr:Item>Document.БольшаяЯчеистаяСборка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументБЯС</Name>
					<Comment>Списанный документ</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолКоробок</Name>
					<Comment>Количество Коробок Для Списания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗонаОтгрузкиТаксист1/Forms/ФормаТоварНаЯчейке/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.Список.ТекущиеДанные.ДокументПрихода);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	НаименованиеМестаОтгрузки=Параметры.НаименованиеМестаОтгрузки;
	Если Параметры.НаименованиеМестаОтгрузки="Ж4" Тогда
		НаименованиеМестаОтгрузки="Палет";	
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("НаименованиеМестаОтгрузки",НаименованиеМестаОтгрузки);

КонецПроцедуры


&НаКлиенте
Процедура СписатьТоварСЗоныОтгрузки(Команда)
	Если Вопрос("Списать выбранные товары с зоны отгрузки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	масСтрок=Элементы.Список.ВыделенныеСтроки;
	Для Каждого идСтроки Из масСтрок Цикл
		//Сообщить(идСтроки);
		СписатьТоварСЗоныОтгрузкиСЕРВЕР(Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода,Элементы.Список.ДанныеСтроки(идСтроки).КоличествоКоробокОстаток,Элементы.Список.ДанныеСтроки(идСтроки).НомерМестаОтгрузки);
		Сообщить("Документ - "+Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода+" - Списан.");
	КонецЦикла;
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура  СписатьТоварСЗоныОтгрузкиСЕРВЕР(ДокБЯС,КолКоробокСписания,МестоОтгрузки)
	
	//***ННН***Проверка на Дублирование
	//нет дублям
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	СписаниеТовараСЗоныОтгрузки.Ссылка
	//|ИЗ
	//|	Документ.СписаниеТовараСЗоныОтгрузки КАК СписаниеТовараСЗоныОтгрузки
	//|ГДЕ
	//|	СписаниеТовараСЗоныОтгрузки.ДокументБЯС = &ДокументБЯС";
	//
	//Запрос.УстановитьПараметр("ДокументБЯС", ДокБЯС);
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Отказ = Истина;
	//	Сообщение=Новый СообщениеПользователю;
	//	Сообщение.Текст="Документ уже списан :" + Строка(Выборка.Ссылка);
	//	Сообщение.КлючДанных=Выборка.Ссылка;
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
		

	новыйДок=Документы.СписаниеТовараСЗоныОтгрузки.СоздатьДокумент();
	новыйДок.ДокументБЯС=ДокБЯС;
	новыйДок.Дата=ТекущаяДата();
	новыйДок.КолКоробок=КолКоробокСписания;
	новыйДок.МестоОтгрузки=МестоОтгрузки;
	новыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("Документ СФ-"+ДокБЯС.номераСФ+" списан(ы)");
	
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьХранениеВЗонеОтгрузки(Команда)
	 Если Вопрос("Продлить хранение выбранных товаров в зоне отгрузки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	масСтрок=Элементы.Список.ВыделенныеСтроки;
	Для Каждого идСтроки Из масСтрок Цикл
		//Сообщить(идСтроки);
		ПродлитьХранениеВЗонеОтгрузкиСЕРВЕР(Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода);
		Сообщить("Документ - "+Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода+" - Продлен.");
	КонецЦикла;

	//ПродлитьХранениеВЗонеОтгрузкиСЕРВЕР(Элементы.Список.ТекущиеДанные.ДокументПрихода);
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Процедура  ПродлитьХранениеВЗонеОтгрузкиСЕРВЕР(докБЯС)
	  док=докБЯС.ПолучитьОбъект();
	  //док.Отладка= док.Отладка+" Продлено-НачалоОтгрузки-"+док.НачалоОтгрузки;
	  док.НачалоОтгрузки=ТекущаяДата();
	   док.Записать();
	  Сообщить("Начало отгрузки изменено на - "+ТекущаяДата());
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьСписаниеТовара(Команда)
	Если Вопрос("Отменить списание выбранных товаров с зоны отгрузки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	масСтрок=Элементы.Список.ВыделенныеСтроки;
	Для Каждого идСтроки Из масСтрок Цикл
		//Сообщить(идСтроки);
		ОтменитьСписаниеТовараСЕРВЕР(Элементы.Список.ДанныеСтроки(идСтроки).ДокументПрихода);
	КонецЦикла;
	Элементы.Список.Обновить();	

КонецПроцедуры

&НаСервере
Процедура ОтменитьСписаниеТовараСЕРВЕР(ДокБЯС)
	Если  Не ЗначениеЗаполнено(ДокБЯС.ДокументСписания) Тогда
		Сообщить("Отменять нечего-Документ не списывался.");
		Возврат;
	КонецЕсли;
	
	ДокБЯСобъект=ДокБЯС.ПолучитьОбъект();
	ДокСписания=ДокБЯС.ДокументСписания.ПолучитьОбъект();
	//ДокСписания=Документы.БольшаяЯчеистаяСборка.НайтиПоНомеру(1).ПолучитьОбъект();
	ДокСписания.УстановитьПометкуУдаления(Истина);
	ДокСписания.Записать();
	
	ДокБЯСобъект.ДокументСписания="";
	ДокБЯСобъект.Списан=Ложь;
	ДокБЯСобъект.Записать();
	Сообщить("Документ - "+ДокБЯС+" - Списание отменено.");
КонецПроцедуры
